Revit 2027 API
CADLinkOptions Constructor
Overload List
Name | Description
CADLinkOptions(CADLinkOptions) |  Constructs a new copy of the input CADLinkOptions object.
CADLinkOptions(Boolean, ElementId) |  Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted.
Top
See Also
Reference
CADLinkOptions Class
Autodesk.Revit.DB Namespace